---
kind: other
id: Methods.T:Autodesk.Revit.DB.GeomCombination
source: html/db99d699-bae4-318c-77a5-25be75c1b6bc.htm
---
# GeomCombination Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.